Added mermaid diagram
